---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DuctFailures
source: html/f4060f18-8758-e97e-7a13-cb4f1c3ccee6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures

Failures about Duct.

## Syntax (C#)
```csharp
public static class DuctFailures
```